gb-resume.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-09-18 Tue 12:47 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Resume of Glenn T. Barry</title>
<meta name="generator" content="Org mode" />
<meta name="author" content="GT Barry" />
</head>
<body>
<div id="content">
<h1 class="title">Resume of Glenn T. Barry</h1>
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org92c8670">1. Description</a></li>
<li><a href="#orgc143c67">2. URLs for this Resume</a>
<ul>
<li><a href="#org175db0c">2.1. Web site: </a></li>
<li><a href="#orge0d802d">2.2. Raw formats including plain text: </a></li>
</ul>
</li>
<li><a href="#org5d7b0ad">3. Contact</a>
<ul>
<li><a href="#orgad9455b">3.1. email: gaak99@gmail.com</a></li>
</ul>
</li>
<li><a href="#orgf667516">4. Computing Technologies</a>
<ul>
<li><a href="#org2136deb">4.1. Github</a></li>
<li><a href="#orge0efb1b">4.2. Languages</a>
<ul>
<li><a href="#orgb02aad7">4.2.1. More experience</a></li>
<li><a href="#org3d5ed7d">4.2.2. Less experience</a></li>
</ul>
</li>
<li><a href="#org2e31b05">4.3. Operating Systems</a>
<ul>
<li><a href="#org25b258b">4.3.1. Unix</a></li>
</ul>
</li>
<li><a href="#org10c9f5f">4.4. Web Frameworks</a>
<ul>
<li><a href="#orga2f6004">4.4.1. Flask</a></li>
<li><a href="#org119a443">4.4.2. Django</a></li>
</ul>
</li>
<li><a href="#org832fb98">4.5. Cloud Services</a>
<ul>
<li><a href="#org8d04a8c">4.5.1. AWS S3 API</a></li>
<li><a href="#org2a932c1">4.5.2. Dropbox API</a></li>
<li><a href="#org475d3d2">4.5.3. FaunaDbAPI</a></li>
<li><a href="#org0018604">4.5.4. Openstack Swift object storage API</a></li>
<li><a href="#org7e14379">4.5.5. rsync.net</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#orgf23c75c">5. Job Experience</a>
<ul>
<li><a href="#seagate">5.1. June 2013 - June 2015, Seagate/Evault, San Francisco, CA.</a>
<ul>
<li><a href="#org4e4858a">5.1.1. Software engineer, Cloud Storage R&amp;D Group.</a></li>
</ul>
</li>
<li><a href="#mmtix">5.2. Sep 2012 - Jan 2013, MeetMeTix.com, Atlanta, GA.</a>
<ul>
<li><a href="#org7530dc9">5.2.1. Contract programmer, Python/Django Web Apps.</a></li>
</ul>
</li>
<li><a href="#sunmicro">5.3. Oct 2001 - Jun 2012, Sun Microsystems (later acquired by Oracle, Inc), Menlo Park, CA.</a>
<ul>
<li><a href="#org9518d3d">5.3.1. Software engineer, Solaris OS/Net Security Technologies.</a></li>
</ul>
</li>
<li><a href="#org28d0948">5.4. Oct 1996 - Oct 2001, Sun Microsystems.</a>
<ul>
<li><a href="#org9fed971">5.4.1. Software engineer, Solaris Sustaining OS/Net Name Services.</a></li>
</ul>
</li>
<li><a href="#emory">5.5. June 1987 - Sep 1996, Emory University MathCS Dept, Atlanta GA.</a></li>
</ul>
</li>
<li><a href="#orgb5337ac">6. Education</a></li>
</ul>
</div>
</div>

<div id="outline-container-org92c8670" class="outline-2">
<h2 id="org92c8670"><span class="section-number-2">1</span> Description</h2>
<div class="outline-text-2" id="text-1">
<p>
Seeking a software development position in Atlanta (or remote) utilizing my skills and job experience detailed below.
</p>
</div>
</div>
<div id="outline-container-orgc143c67" class="outline-2">
<h2 id="orgc143c67"><span class="section-number-2">2</span> URLs for this Resume</h2>
<div class="outline-text-2" id="text-2">
</div>
<div id="outline-container-org175db0c" class="outline-3">
<h3 id="org175db0c"><span class="section-number-3">2.1</span> Web site: <a href="https://gaak99.github.io/resume">https://gaak99.github.io/resume</a></h3>
</div>
<div id="outline-container-orge0d802d" class="outline-3">
<h3 id="orge0d802d"><span class="section-number-3">2.2</span> Raw formats including plain text: <a href="https://github.com/gaak99/gb-res">https://github.com/gaak99/gb-res</a></h3>
</div>
</div>
<div id="outline-container-org5d7b0ad" class="outline-2">
<h2 id="org5d7b0ad"><span class="section-number-2">3</span> Contact</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-orgad9455b" class="outline-3">
<h3 id="orgad9455b"><span class="section-number-3">3.1</span> email: gaak99@gmail.com</h3>
</div>
</div>
<div id="outline-container-orgf667516" class="outline-2">
<h2 id="orgf667516"><span class="section-number-2">4</span> Computing Technologies</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org2136deb" class="outline-3">
<h3 id="org2136deb"><span class="section-number-3">4.1</span> <a href="https://github.com/gaak99">Github</a></h3>
</div>
<div id="outline-container-orge0efb1b" class="outline-3">
<h3 id="orge0efb1b"><span class="section-number-3">4.2</span> Languages</h3>
<div class="outline-text-3" id="text-4-2">
</div>
<div id="outline-container-orgb02aad7" class="outline-4">
<h4 id="orgb02aad7"><span class="section-number-4">4.2.1</span> More experience</h4>
<div class="outline-text-4" id="text-4-2-1">
</div>
<ol class="org-ol">
<li><a id="org3b1fbd2"></a>Python<br />
<ol class="org-ol">
<li><a id="orgf782879"></a><i>oxly</i> auto-merges Dropbox file revisions with a <i>git</i>-like cli <a href="https://github.com/gaak99/oxly">github</a><br />
<div class="outline-text-6" id="text-4-2-1-1-1">
<p>
The side project that I put the most time into and use on a regular basis.
</p>

<p>
It uses the basic Python object oriented features and some advanced Python features such as decorators.
I wrote the <i>_dbxauth</i> decorator in <a href="https://github.com/gaak99/oxly/blob/master/oxly/core.py">oxly/core.py</a> and the excellent
<i>Click</i> CLI argument processing library/API used here is heavily based
on them (see <a href="https://github.com/gaak99/oxly/blob/master/oxly/scripts/clickit.p">oxly/scripts/clickit.py</a>).
</p>
</div>
</li>
<li><a id="org876a2ff"></a>see also Seagate <a href="#seagate">below</a><br /></li>
</ol>
</li>
<li><a id="orgd95bb71"></a>C<br />
<ol class="org-ol">
<li><a id="orgd659633"></a>see Sun Microsystems <a href="#sunmicro">below</a><br /></li>
</ol>
</li>
<li><a id="org5b32c5a"></a>bash(1)<br />
<ol class="org-ol">
<li><a id="org597d8ad"></a><i>oxmerge</i> is a shell wrapper for the <i>oxly</i> common case <a href="https://github.com/gaak99/oxly/blob/master/oxly/scripts/oxmerge.sh">github</a><br /></li>
<li><a id="orgdb4ac52"></a>see also Emory <a href="#emory">below</a><br /></li>
</ol>
</li>
</ol>
</div>
<div id="outline-container-org3d5ed7d" class="outline-4">
<h4 id="org3d5ed7d"><span class="section-number-4">4.2.2</span> Less experience</h4>
<div class="outline-text-4" id="text-4-2-2">
</div>
<ol class="org-ol">
<li><a id="org1ff5f3c"></a>Rust<sup><a id="fnr.1" class="footref" href="#fn.1">1</a></sup><br />
<ol class="org-ol">
<li><a id="org216cdfc"></a>Remacs open source project - "oxidize" (port) C layer of GNU Emacs to Rust <a href="https://github.com/Wilfred/remacs/blob/master/rust_src/src/dired_unix.rs">github</a><br />
<div class="outline-text-6" id="text-4-2-2-1-1">
<p>
I <del>ported</del> re-wrote several low level directory/file functions from C to Rust.
</p>

<p>
I contributed 98% (as of Aug '18) of the code in the dired Rust files.
</p>

<p>
I used some functional style Rust features here in <a href="https://github.com/Wilfred/remacs/blob/master/rust_src/src/dired_unix.rs">dired unix.rs</a> (see <i>fattrs<sub>to</sub><sub>list</sub></i>).
</p>
</div>
</li>
</ol>
</li>
<li><a id="org422852f"></a>Lisp<br />
<ol class="org-ol">
<li><a id="org4bf7b1e"></a>Clojure<br />
<ol class="org-ol">
<li><a id="org3f85819"></a>Concurrent recursive "grep" using <i>Clojure.core.async</i> Go-style channels <a href="https://gist.github.com/gaak99/94305797fe5c81e6f20bd2095ec23152">github</a><br /></li>
</ol>
</li>
<li><a id="org1f87913"></a>Basic bloom filter implementation in Emacs Lisp <a href="https://github.com/gaak99/emacs-bloomfilter">github</a><br />
<div class="outline-text-6" id="text-4-2-2-2-2">
<p>
I used the <a href="https://github.com/magnars/dash.el">dash</a> uber modern/functional Lisp list library.
</p>
</div>
</li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-org2e31b05" class="outline-3">
<h3 id="org2e31b05"><span class="section-number-3">4.3</span> Operating Systems</h3>
<div class="outline-text-3" id="text-4-3">
</div>
<div id="outline-container-org25b258b" class="outline-4">
<h4 id="org25b258b"><span class="section-number-4">4.3.1</span> Unix</h4>
<div class="outline-text-4" id="text-4-3-1">
</div>
<ol class="org-ol">
<li><a id="org40d0ec0"></a>Ubuntu Linux<br />
<div class="outline-text-5" id="text-4-3-1-1">
<p>
My dev laptop runs Ubuntu 16.04. See also Seagate <a href="#seagate">below</a>.
</p>
</div>
</li>
<li><a id="org94faf99"></a>Solaris / OpenSolaris<br />
<div class="outline-text-5" id="text-4-3-1-2">
<p>
See Sun Microsystems <a href="#sunmicro">below</a>.
</p>
</div>
</li>
<li><a id="org72338d7"></a>SmartOS<br />
<div class="outline-text-5" id="text-4-3-1-3">
<p>
This cloud optimized derivative of OpenSolaris has some unique features for cloud devops such as DTrace.
</p>
</div>
</li>
</ol>
</div>
</div>
<div id="outline-container-org10c9f5f" class="outline-3">
<h3 id="org10c9f5f"><span class="section-number-3">4.4</span> Web Frameworks</h3>
<div class="outline-text-3" id="text-4-4">
</div>
<div id="outline-container-orga2f6004" class="outline-4">
<h4 id="orga2f6004"><span class="section-number-4">4.4.1</span> Flask</h4>
<div class="outline-text-4" id="text-4-4-1">
</div>
<ol class="org-ol">
<li><a id="orgb0d4cb0"></a>see Seagate <a href="#seagate">below</a><br /></li>
</ol>
</div>
<div id="outline-container-org119a443" class="outline-4">
<h4 id="org119a443"><span class="section-number-4">4.4.2</span> Django</h4>
<div class="outline-text-4" id="text-4-4-2">
</div>
<ol class="org-ol">
<li><a id="orgc3a01bb"></a>see MeetMeTix <a href="#mmtix">below</a><br /></li>
</ol>
</div>
</div>
<div id="outline-container-org832fb98" class="outline-3">
<h3 id="org832fb98"><span class="section-number-3">4.5</span> Cloud Services</h3>
<div class="outline-text-3" id="text-4-5">
</div>
<div id="outline-container-org8d04a8c" class="outline-4">
<h4 id="org8d04a8c"><span class="section-number-4">4.5.1</span> AWS S3 API</h4>
<div class="outline-text-4" id="text-4-5-1">
</div>
<ol class="org-ol">
<li><a id="org5820184"></a>see Seagate <a href="#seagate">below</a><br /></li>
</ol>
</div>
<div id="outline-container-org2a932c1" class="outline-4">
<h4 id="org2a932c1"><span class="section-number-4">4.5.2</span> Dropbox API</h4>
<div class="outline-text-4" id="text-4-5-2">
</div>
<ol class="org-ol">
<li><a id="org9c83708"></a><i>oxly</i> side project <a href="https://github.com/gaak99/oxly">github</a><br /></li>
</ol>
</div>
<div id="outline-container-org475d3d2" class="outline-4">
<h4 id="org475d3d2"><span class="section-number-4">4.5.3</span> FaunaDb<sup><a id="fnr.2" class="footref" href="#fn.2">2</a></sup> API</h4>
<div class="outline-text-4" id="text-4-5-3">
</div>
<ol class="org-ol">
<li><a id="org2d49aba"></a><i>ATL100</i> side project <a href="https://github.com/gaak99/atl100">github</a><br /></li>
<li><a id="orgfb0e91d"></a><i>hylisp</i> side project <a href="https://github.com/gaak99/faunadb-hylisp">github</a><br /></li>
</ol>
</div>
<div id="outline-container-org0018604" class="outline-4">
<h4 id="org0018604"><span class="section-number-4">4.5.4</span> Openstack Swift object storage API</h4>
<div class="outline-text-4" id="text-4-5-4">
</div>
<ol class="org-ol">
<li><a id="org3856d78"></a>see Seagate <a href="#seagate">below</a><br /></li>
</ol>
</div>
<div id="outline-container-org7e14379" class="outline-4">
<h4 id="org7e14379"><span class="section-number-4">4.5.5</span> rsync.net</h4>
<div class="outline-text-4" id="text-4-5-5">
</div>
<ol class="org-ol">
<li><a id="org33cd79a"></a>ZFS as a Service<br />
<div class="outline-text-5" id="text-4-5-5-1">
<p>
It's one of my favorite backup services as not only does it provide a
familiar Unix file system interface (via sshfs) but also provides
read-only snapshots several times a day.
</p>
</div>
</li>
</ol>
</div>
</div>
</div>
<div id="outline-container-orgf23c75c" class="outline-2">
<h2 id="orgf23c75c"><span class="section-number-2">5</span> Job Experience</h2>
<div class="outline-text-2" id="text-5">
</div>
<div id="outline-container-orgbe4d9bf" class="outline-3">
<h3 id="seagate"><a id="orgbe4d9bf"></a><span class="section-number-3">5.1</span> June 2013 - June 2015, Seagate/Evault, San Francisco, CA.</h3>
<div class="outline-text-3" id="text-seagate">
<p>
I was one of the first engineers hired to this project that started as a skunkworks within Evault &#x2013; a wholly-owned subsidiary of Seagate &#x2013; and last half of my tenure there we were brought into Seagate for the new Cloud Storage division.
</p>
</div>
<div id="outline-container-org4e4858a" class="outline-4">
<h4 id="org4e4858a"><span class="section-number-4">5.1.1</span> Software engineer, Cloud Storage R&amp;D Group.</h4>
<div class="outline-text-4" id="text-5-1-1">
</div>
<ol class="org-ol">
<li><a id="org5108a64"></a>Major project<br />
<ol class="org-ol">
<li><a id="orgdd5b41a"></a>LTS2.evault.com -  cheaper and faster retrieval (vs AWS Glacier) of long-term object storage service<br />
<div class="outline-text-6" id="text-5-1-1-1-1">
<p>
The service was based on Openstack Swift<sup><a id="fnr.3" class="footref" href="#fn.3">3</a></sup> object storage open source project..
</p>

<p>
Swift runs on a Ubuntu cluster (we had one cluster in Salt Lake City and a second one in Oklahoma City).
</p>

<p>
Swift is many thousands of lines of Python 2 and is heavily object oriented.
And the code tends to be of high quality as it has many eyes of Python experts for code review.
</p>
</div>
<ol class="org-ol">
<li><a id="orgec43ecf"></a>I "owned" Swift S3 emulation module aka fixed many bugs<br /></li>
<li><a id="orgcf7b6f7"></a>Data center to data center object replication perf improvements<br /></li>
<li><a id="orge77a183"></a>Basic web services  w/Python Flask - passwd reset, etc.<br /></li>
<li><a id="org2c50d6c"></a>Agile methodology and JIRA/Confluence/Stash was used for all the projects<br /></li>
</ol>
</li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-org59b00e8" class="outline-3">
<h3 id="mmtix"><a id="org59b00e8"></a><span class="section-number-3">5.2</span> Sep 2012 - Jan 2013, MeetMeTix.com, Atlanta, GA.</h3>
<div class="outline-text-3" id="text-mmtix">
</div>
<div id="outline-container-org7530dc9" class="outline-4">
<h4 id="org7530dc9"><span class="section-number-4">5.2.1</span> Contract programmer, Python/Django Web Apps.</h4>
<div class="outline-text-4" id="text-5-2-1">
</div>
<ol class="org-ol">
<li><a id="org1abffa1"></a>Major Projects:<br />
<ol class="org-ol">
<li><a id="orgf755b6d"></a>Single sign-on for the site<br />
<div class="outline-text-6" id="text-5-2-1-1-1">
<p>
Integrated/tested/refined Django-Social-Auth app for Facebook single sign-on feature.
</p>
</div>
</li>
<li><a id="orgef52ada"></a>Developed (Python) from scratch a full Selenium automated test suite.<br /></li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-org233a53f" class="outline-3">
<h3 id="sunmicro"><a id="org233a53f"></a><span class="section-number-3">5.3</span> Oct 2001 - Jun 2012, Sun Microsystems (later acquired by Oracle, Inc), Menlo Park, CA.</h3>
<div class="outline-text-3" id="text-sunmicro">
</div>
<div id="outline-container-org9518d3d" class="outline-4">
<h4 id="org9518d3d"><span class="section-number-4">5.3.1</span> Software engineer, Solaris OS/Net Security Technologies.</h4>
<div class="outline-text-4" id="text-5-3-1">
</div>
<ol class="org-ol">
<li><a id="org977e79a"></a>Last few projects:<br />
<ol class="org-ol">
<li><a id="org71f391f"></a>Solaris secure boot feature<br />
<div class="outline-text-6" id="text-5-3-1-1-1">
<p>
Refined initial design with an emphasis on next generation SPARC systems.
</p>
</div>
</li>
<li><a id="orgccba0b5"></a>Diagnosability improvements of Solaris Secure NFS/SMB (C development)<br /></li>
<li><a id="orga8252ff"></a>Kerberos KDC server db replication  (C development)<br />
<div class="outline-text-6" id="text-5-3-1-1-3">
<p>
I led team and co-designed/developed RPC-based DB
replication protocol/feature for the Kerberos KDC.
</p>
</div>
</li>
<li><a id="orge620169"></a>Solaris kernel RPC GSS modules server performance improvements  (C development)<br /></li>
<li><a id="orga479faf"></a>Solaris single sign-on via GSS/Kerberos (C development)<br /></li>
</ol>
</li>
</ol>
</div>
</div>
<div id="outline-container-org28d0948" class="outline-3">
<h3 id="org28d0948"><span class="section-number-3">5.4</span> Oct 1996 - Oct 2001, Sun Microsystems.</h3>
<div class="outline-text-3" id="text-5-4">
</div>
<div id="outline-container-org9fed971" class="outline-4">
<h4 id="org9fed971"><span class="section-number-4">5.4.1</span> Software engineer, Solaris Sustaining OS/Net Name Services.</h4>
<div class="outline-text-4" id="text-5-4-1">
</div>
<ol class="org-ol">
<li><a id="org54f2d3c"></a>Diagnosed/coded/tested fixes (C language) for escalated bugs.<br /></li>
</ol>
</div>
</div>
<div id="outline-container-org3fd0263" class="outline-3">
<h3 id="emory"><a id="org3fd0263"></a><span class="section-number-3">5.5</span> June 1987 - Sep 1996, Emory University MathCS Dept, Atlanta GA.</h3>
<div class="outline-text-3" id="text-emory">
<p>
Unix System Administrator.
</p>
</div>
</div>
</div>
<div id="outline-container-orgb5337ac" class="outline-2">
<h2 id="orgb5337ac"><span class="section-number-2">6</span> Education</h2>
<div class="outline-text-2" id="text-6">
<p>
June 1981 - 1987, Georgia Tech, BS in Info and Computer Science.
</p>
</div>
</div>
<div id="footnotes">
<h2 class="footnotes">Footnotes: </h2>
<div id="text-footnotes">

<div class="footdef"><sup><a id="fn.1" class="footnum" href="#fnr.1">1</a></sup> <div class="footpara"><p class="footpara">
<a href="https://en.wikipedia.org/wiki/Rust_(programming_language)">Wikipedia</a>
</p>
<blockquote>
<p>
Rust is a systems programming language sponsored by Mozilla which
describes it as a "safe, concurrent, practical language", supporting
functional and imperative-procedural paradigms. Rust is syntactically
similar to C++[according to whom?], but its designers intend it to
provide better memory safety while still maintaining performance.
</p>
</blockquote></div></div>

<div class="footdef"><sup><a id="fn.2" class="footnum" href="#fnr.2">2</a></sup> <div class="footpara"><p class="footpara">
<a href="https://www.infoq.com/news/2017/03/faunadb">Infoq</a>
</p>
<blockquote>
<p>
FaunaDB is a transactional, temporal, geographically distributed,
strongly consistent, secure, multi-tenant, QoS-managed operational
database. It's implemented on the JVM for portability, and it's
relational, but not SQL. Instead, it's queried via type-safe embedded
DSLs, like LINQ. FaunaDB is a return to the general database purpose
model, but built for the cloud instead of the mainframes of the 80s.
</p>
</blockquote></div></div>

<div class="footdef"><sup><a id="fn.3" class="footnum" href="#fnr.3">3</a></sup> <div class="footpara"><p class="footpara">
<a href="https://wiki.openstack.org/wiki/Swift">Openstack Wiki</a>
</p>
<blockquote>
<p>
The OpenStack Object Store project, known as Swift, offers cloud
storage software so that you can store and retrieve lots of data with
a simple API. It's built for scale and optimized for durability,
availability, and concurrency across the entire data set. Swift is
ideal for storing unstructured data that can grow without bound.
</p>
</blockquote></div></div>


</div>
</div></div>
<div id="postamble" class="status">
<p class="author">Author: GT Barry</p>
<p class="date">Created: 2018-09-18 Tue 12:47</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
